app/views/users/show.html.erb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 3]]
---
    <%= @user.profile.first_name %> <%= @user.profile.last_name %>