app/controllers/contacts_controller.rb

        def create
              @contact = Contact.new(contact_params)

              if @contact.save
---
INSERT INTO "contacts" ("comments", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comments", "test"], ["created_at", "2015-03-16 23:22:17.993557"], ["email", "marc@marcfitten.com"], ["name", "mfitten"], ["updated_at", "2015-03-16 23:22:17.993557"]]