app/controllers/pages_controller.rb

        def home
          @basic_plan = Plan.find(1)
---
SELECT  "plans".* FROM "plans"  WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]